import Mathlib.Tactic
--9.Linear Algebra
--9.1 Vector spaces and linear maps
--9.1.2 Linear maps
variable {K : Type*} [Field K] {V : Type*} [AddCommGroup V] [Module K V]
variable  {W : Type*} [AddCommGroup W] [Module K W]
-----------------------------------------------------------
variable (φ : V →ₗ[K] W)
-----------------------------------------------------------
example (a : K) (v : V) : φ (a • v) = a • φ v :=
  map_smul φ a v
-----------------------------------------------------------
example (v w : V) : φ (v + w) = φ v + φ w :=
  map_add φ v w
-----------------------------------------------------------
variable (ψ : V →ₗ[K] W)
-----------------------------------------------------------
#check (2 • φ + ψ : V →ₗ[K] W)
-----------------------------------------------------------
variable (θ : W →ₗ[K] V)
-----------------------------------------------------------
#check (φ.comp θ : W →ₗ[K] W)
-----------------------------------------------------------
#check (φ ∘ₗ θ : W →ₗ[K] W)
-----------------------------------------------------------
example : V →ₗ[K] V where
  toFun v := 3 • v
  map_add' _ _ := smul_add ..
  map_smul' _ _ := smul_comm ..
-----------------------------------------------------------
#check (φ.map_add' : ∀ x y : V, φ.toFun (x + y) = φ.toFun x + φ.toFun y)
-----------------------------------------------------------
#check (φ.map_add : ∀ x y : V, φ (x + y) = φ x + φ y)
-----------------------------------------------------------
#check (map_add φ : ∀ x y : V, φ (x + y) = φ x + φ y)
-----------------------------------------------------------
#check (LinearMap.lsmul K V 3 : V →ₗ[K] V)
-----------------------------------------------------------
#check (LinearMap.lsmul K V : K →ₗ[K] V →ₗ[K] V)
-----------------------------------------------------------
example (f : V ≃ₗ[K] W) : f ≪≫ₗ f.symm = LinearEquiv.refl K V :=
  f.self_trans_symm
-----------------------------------------------------------
noncomputable example (f : V →ₗ[K] W) (h : Function.Bijective f) : V ≃ₗ[K] W :=
  .ofBijective f h
-----------------------------------------------------------
